USE Library_fund
GO

INSERT INTO library_fund
      (city_name)
VALUES
      (N'Київ'),
      (N'Харків'),
      (N'Одеса'),
      (N'Дніпро'),
      (N'Львів');
GO

INSERT INTO library
      (library_fund_id, name, address)
VALUES
      (1, N'Публічна бібліотека ім. Лесі Українки для дорослих м. Києва', N'Вул. Олександра Кониського, 83/85'),
      (1, N'Спеціалізована молодіжна бібліотека м. Києва', N'Вул. Гетьмана Павла Скоропадського, 49'),
      (1, N'Центральна бібліотека ім. Т. Г .Шевченка для дітей м. Києва', N'Просп. Берестейський, 25А'),

      (2, N'Харківська державна наукова бібліотека імені В. Г. Короленка' , N'Пров. Короленка, 18'),
      (2, N'Харківська наукова медична бібліотека', N'Вул. Архітекторів, 40, корп. Г'),
      (2, N'Харківська обласна бібліотека для дітей', N'Вул. Алчевських, 43'),

      (3, N'Одеська національна наукова бібліотека' , N'Вул. Пастера, 13, район Сахалінчик'),
      (3, N'Бібліотека ім. М. С. Грушевського', N'Вул. Троїцька 49/51'),
      (3, N'Дитяча бібліотека № 9', N'Французький бульвар, 11'),

      (4, N'Дніпропетровська обласна бібліотека для дітей' , N'Вул. Сергія Єфремова, д.9'),
      (4, N'Бібліотека української діаспори ім. Джона Маккейна', N'Вул. Воскресенська, 23'),
      (4, N'Бібліотека-філіал № 2 Дніпровської ЦСПБ для дорослих ', N'Вул. Щепкіна, 10 ('),

      (5, N'Львівська державна бібліотека для юнацтва' , N'Пл. Ринок, 9'),
      (5, N'Львівська обласна бібліотека для дітей', N'Вул. Винниченка, 1'),
      (5, N'Бібліотека Українського товариства сліпих', N'Вул. Січових Стрільців, 5');
GO

INSERT INTO reading_room
      (library_id)
VALUES
      (1),
      (2),
      (2),
      (3),
      (3),
      (3),
      (4),
      (4),
      (5);
GO

INSERT INTO position
      (name)
VALUES
      (N'Бібліотекар'),
      (N'Прибиральник'),
      (N'Архіваріус'),
      (N'Системний адміністратор'),
      (N'Асистент');
GO

INSERT INTO employee
      (library_id, position_id, first_name, last_name, phone_number)
VALUES
      (1, 1, N'Олександр', N'Шевченко', N'+380501234567'),
      (1, 3, N'Василь', N'Клименко', N'+380671234569'),
      (1, 2, N'Ілля', N'Ткачук', N'+380931234571'),

      (2, 1, N'Катерина', N'Коваленко', N'+380671234567'),
      (2, 2, N'Галина', N'Гаврилюк', N'+380931234569'),
      (2, 4, N'Софія', N'Жукова', N'+380991234571'),

      (3, 1, N'Іван', N'Бондаренко', N'+380931234567'),
      (3, 3, N'Олег', N'Павленко', N'+380991234569'),
      (3, 5, N'Роман', N'Вороненко', N'+380661234571'),

      (4, 1, N'Марія', N'Ткаченко', N'+380991234567'),
      (4, 4, N'Світлана', N'Демченко', N'+380661234569'),
      (4, 2, N'Люба', N'Назаренко', N'+380681234571'),

      (5, 1, N'Андрій', N'Мельник', N'+380661234567'),
      (5, 2, N'Руслан', N'Іванченко', N'+380681234569'),
      (5, 5, N'Юлія', N'Романенко', N'+380731234571'),

      (6, 1, N'Ольга', N'Гончар', N'+380681234567'),
      (6, 3, N'Анна', N'Мартинюк', N'+380731234569'),
      (6, 4, N'Володимир', N'Сидоренко', N'+380501234572'),

      (7, 1 , N'Дмитро', N'Кравченко', N'+380731234567'),
      (7, 2, N'Сергій', N'Василенко', N'+380501234570'),
      (7, 5, N'Олеся', N'Герасименко', N'+380671734572'),

      (8, 1, N'Анастасія', N'Романюк', N'+380501234568'),
      (8, 2, N'Євгенія', N'Кириленко', N'+380671234570'),
      (8, 3, N'Арсен', N'Мироненко', N'+380935334572'),

      (9, 1, N'Юрій', N'Лисенко', N'+380675334568'),
      (9, 4, N'Тарас', N'Чорний', N'+380931313457'),
      (9, 5, N'Оксана', N'Щербак', N'+380953234572'),

      (10, 1, N'Ірина', N'Сергієнко', N'+380931234568'),
      (10, 5, N'Лариса', N'Білоус', N'+380991634570'),
      (10, 2, N'Назар', N'Павлюк', N'+380661234572'),

      (11, 1, N'Михайло', N'Петренко', N'+380991234568'),
      (11, 3, N'Олександра', N'Діденко', N'+380671534573'),
      (11, 5, N'Володимир', N'Сидоренко', N'+380501234573'),

      (12, 1, N'Людмила', N'Савченко', N'+380661234568'),
      (12, 2, N'Іванна', N'Симоненко', N'+380931234573'),
      (12, 4, N'Олеся', N'Герасименко', N'+380671234573'),

      (13, 1, N'Віталій', N'Федоренко', N'+380681234568'),
      (13, 3, N'Богдан', N'Глущенко', N'+380991234573'),
      (13, 5, N'Арсен', N'Мироненко', N'+380931234572'),

      (14, 1, N'Оксана', N'Захарченко', N'+380731234568'),
      (14, 2, N'Мар`яна', N'Литвин', N'+380661234573'),
      (14, 4, N'Оксана', N'Щербак', N'+380991234572'),

      (15, 1, N'Наталія', N'Пономаренко', N'+380501234569'),
      (15, 3, N'Максим', N'Коваленко', N'+380671244571'),
      (15, 4, N'Олег', N'Грицай', N'+380681634573');
GO

INSERT INTO reader_category
      (name)
VALUES
      (N'Студент'),
      (N'Науковець'),
      (N'Вчитель'),
      (N'Працівник')
GO

INSERT INTO reader
      (library_fund_id, category_id, first_name, last_name, date_of_birth, phone_number)
VALUES
      (1, 1, N'Олег', N'Літвінов', N'1996-07-15', N'+380681234573'),
      (1, 2, N'Марія', N'Ганзера', N'2003-11-28', N'+380681234576'),
      (2, 3, N'Антон', N'Положий', N'1992-05-03', NULL),
      (2, 4, N'Нікіта', N'Коваленко', N'2008-09-22', N'+380661254573'),
      (3, 1, N'Павло', N'Лебідь', N'1997-03-10', N'+380661254572')
GO

INSERT INTO book_category
      (name)
VALUES
      (N'Книга'),
      (N'Журнал'),
      (N'Газета'),
      (N'Реферат'),
      (N'Дисертація')
GO

INSERT INTO book
      (name, category_id)
VALUES
      -- Джордж Оруелл (Фантастика, Нон-фікшн)
      (N'1984', 1),
      -- Оноре де Бальзак (Нон-фікшн, Пригоди)
      (N'Гобсек', 1),
      -- Вільям Шекспір (Романтика, Драма)
      (N'Ромео і Джульєтта', 1),
      -- Франц Кафка (Нон-фікшн, Фантастика)
      (N'Процес', 1),
      -- Гомер (Наука, Фентезі)
      (N'Одіссея', 1),
      -- Джордж Оруелл (Фантастика, Наука)
      (N'Колгосп тварин', 1),
      -- Франц Кафка (Фантастика, Нон-фікшн)
      (N'Метаморфоза', 1),
      -- Оноре де Бальзак (Нон-фікшн, Жахи)
      (N'Батько Горіо', 1),
      -- Вільям Шекспір (Романтика, Драма)
      (N'Гамлет', 1),
      -- Франц Кафка (Нон-фікшн, Фантастика)
      (N'Замок', 1),
      -- Гомер (Наука, Фентезі)
      (N'Іліада', 1);                   
GO

INSERT INTO genre
      (name)
VALUES
      (N'Наука'),
      (N'Фентезі'),
      (N'Нон-фікшн'),
      (N'Романтика'),
      (N'Фантастика'),
      (N'Жахи'),
      (N'Пригоди'),
      (N'Драма');
GO

INSERT INTO book_genre
      (book_id, genre_id)
VALUES
      -- 1984 (Фантастика)
      (1, 5),
      -- 1984 (Нон-фікшн)
      (1, 3),
      -- Гобсек (Нон-фікшн)
      (2, 3),
      -- Гобсек (Пригоди)
      (2, 7),
      -- Ромео і Джульєтта (Романтика)
      (3, 4),
      -- Ромео і Джульєтта (Драма)
      (3, 7),
      -- Процес (Нон-фікшн)
      (4, 3),
      -- Процес (Фантастика)
      (4, 5),
      -- Одіссея (Наука)
      (5, 1),
      -- Одіссея (Фентезі)
      (5, 2),
      -- Колгосп тварин (Наука)
      (6, 1),
      -- Колгосп тварин (Фантастика)
      (6, 5),
      -- Метаморфоза (Фантастика)
      (7, 5),
      -- Метаморфоза (Нон-фікшн)
      (7, 3),
      -- Батько Горіо (Нон-фікшн)
      (8, 3),
      -- Батько Горіо (Жахи)
      (8, 6),
      -- Гамлет (Романтика)
      (9, 4),
      -- Гамлет (Драма)
      (9, 7),
      -- Замок (Нон-фікшн)
      (10, 3),
      -- Замок (Фантастика)
      (10, 5),
      -- Іліада (Наука)
      (11, 1),
      -- Іліада (Фентезі)
      (11, 2); 
GO

INSERT INTO author
      (name)
VALUES
      (N'Джордж Оруелл'),
      (N'Оноре де Бальзак'),
      (N'Вільям Шекспір'),
      (N'Франц Кафка'),
      (N'Гомер');
GO

INSERT INTO book_author
      (book_id, author_id)
VALUES
      -- 1984 / Джордж Оруелл
      (1, 1),
      -- Гобсек / Оноре де Бальзак 
      (2, 2),
      -- Ромео і Джульєтта / Вільям Шекспір
      (3, 3),
      -- Процес / Франц Кафка 
      (4, 4),
      -- Одіссея / Гомер
      (5, 5),
      -- Колгосп тварин / Джордж Оруелл 
      (6, 1),
      -- Метаморфоза / Франц Кафка 
      (7, 4),
      -- Батько Горіо / Оноре де Бальзак
      (8, 2),
      -- Гамлет / Вільям Шекспір (Романтика, Драма)
      (9, 3),
      -- Замок / Франц Кафка 
      (10, 4),
      -- Іліада / Гомер                
      (11, 5);
GO

INSERT INTO book_copy
      (book_id, reader_id, reading_room_id, publisher, year)
VALUES

      -- 1984 / Джордж Оруелл
      (1, NULL, 2, N'Видавництво Жупанського', 2015),
      (1, 1, NULL, N'Фоліо', 2023),
      -- Гобсек / Оноре де Бальзак 
      (2, 2, NULL, N'Андронум', 2021),
      (2, 2, NULL, N'Пальмира', 2016),
      -- Ромео і Джульєтта / Вільям Шекспір
      (3, 2, NULL, N'Oxford University Press', 2008),
      (3, 3, NULL, N'Апріорі', 2022),
      -- Процес / Франц Кафка 
      (4, 4, 4, N'Фоліо', 2014),
      (4, 3, 4, N'Фоліо', 2017),
      -- Одіссея / Гомер
      (5, 2, NULL, N'Фоліо', 2023),
      (5, NULL, 5, N'Collectors Library', 2004),
      -- Колгосп тварин / Джордж Оруелл 
      (6, 5, NULL, N'Flame Tree', 2021),
      (6, 4, NULL, N'Знання', 2022),
      -- Метаморфоза / Франц Кафка 
      (7, NULL, 2, N'Фоліо', 2019),
      (7, NULL, 1, N'Мультимедійне видавництво Стрельбицького', 2020),
      -- Батько Горіо / Оноре де Бальзак
      (8, 3, NULL, N'Знання', 2016),
      (8, 2, NULL, N'Андронум', 2022),
      -- Гамлет / Вільям Шекспір 
      (9, 5, NULL, N'Фоліо', 2011),
      (9, 2, NULL, N'А-ба-ба-га-ла-ма-га', 2008),
      -- Замок / Франц Кафка 
      (10, NULL, 2, N'Фоліо', 2014),
      (10, NULL, 3, N'Фоліо', 2018),
      -- Іліада / Гомер                
      (11, 1, NULL, N'Фоліо', 2023),
      (11, 4, NULL, N'Андронум', 2021);
GO